In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.read_csv('bengaluru_house_prices.csv')

In [3]:
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [5]:
data.shape

(13320, 9)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [8]:
for col in data.columns:
    print(data[col].value_counts())
    print("--"*20)

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
----------------------------------------
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
15-Aug               1
17-Jan               1
16-Nov               1
16-Jan               1
14-Jul               1
Name: availability, Length: 81, dtype: int64
----------------------------------------
Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1305, dtype: int64
----------------------------------------
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64
----------------------------------------
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Amionce     1
JaghtDe     1
Jauraht     1
Brity U     1
RSntsAp     1
Name: society, Length: 2688, dtype: int64
----------------------------------------
1200    843
1100    221
1500    205
2400    196
600     180
       ...
3580      1
2461      1
1437      1
2155      1
4689      1
Name: total_sqft, Length: 2117, dtype: int64
----------------------------------------
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: bath, dtype: int64
----------------------------------------
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
----------------------------------------
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
351.00      1
54.10       1
80.64       1
32.73       1
488.00      1
Name: price, Length: 1994, dtype: int64
----------------------------------------

In [9]:
data.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [10]:
## data shape is 13320 society column is 5502 almost 50%

In [11]:
data.drop(columns=['area_type','availability','society','balcony'],inplace=True)

In [12]:
data.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [14]:
data.isna().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [15]:
## location missing value

In [16]:
data['location'].value_counts()

Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1305, dtype: int64

In [17]:
data['location']=data['location'].fillna('Whitefield')

In [18]:
data.isna().sum()

location       0
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [19]:
## size missing value

In [20]:
data['size'].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64

In [21]:
data['size']=data['size'].fillna('2 BHK')

In [22]:
data.isna().sum()

location       0
size           0
total_sqft     0
bath          73
price          0
dtype: int64

In [23]:
## bath missing value

In [24]:
data['bath'].value_counts()

2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: bath, dtype: int64

In [25]:
data['bath']=data['bath'].fillna(data['bath'].median())

In [26]:
data.isna().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [27]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13320 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [29]:
data['BHK']=data['size'].str.split().str.get(0).astype(int)

In [30]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13320 non-null  float64
 4   price       13320 non-null  float64
 5   BHK         13320 non-null  int32
dtypes: float64(2), int32(1), object(3)
memory usage: 572.5+ KB

In [31]:
data[data.BHK>20]   ## outliers

                       location        size total_sqft  bath  price  BHK
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [32]:
data['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [33]:
def convertRange(x):
    temp=x.split('-')
    if len(temp)==2:
        return (float(temp[0]))+(float(temp[0]))/2
    try:
        return float(x)
    except:
        return None

In [34]:
data['total_sqft']=data['total_sqft'].apply(convertRange)   ## apply

In [35]:
data.head()

                   location       size  total_sqft  bath   price  BHK
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [36]:
## price_per_sqft  new column for removing outliers

In [37]:
data['price_per_sqft']=data['price']*100000/data['total_sqft']

In [38]:
data['price_per_sqft']

0         3699.810606
1         4615.384615
2         4305.555556
3         6245.890861
4         4250.000000
             ...
13315     6689.834926
13316    11111.111111
13317     5258.545136
13318    10407.336319
13319     3090.909091
Name: price_per_sqft, Length: 13320, dtype: float64

In [39]:
data.describe()

         total_sqft          bath         price           BHK  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1569.194241      2.688814    112.565627      2.802778    7.887991e+03
std     1249.984492      1.338754    148.971674      1.294496    1.064301e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.236493e+03
50%     1280.000000      2.000000     72.000000      3.000000    5.416667e+03
75%     1688.090000      3.000000    120.000000      3.000000    7.299270e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [40]:
data['location'].value_counts()

Whitefield                        541
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1305, dtype: int64

In [42]:
data['location']=data['location'].apply(lambda x:x.strip())
loc_count=data['location'].value_counts()
loc_count

Whitefield                        542
Sarjapur  Road                    399
Electronic City                   304
Kanakpura Road                    273
Thanisandra                       237
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1294, dtype: int64

In [43]:
loc_less_10=loc_count[loc_count<=10]

In [44]:
loc_less_10

Dairy Circle                      10
Nagappa Reddy Layout              10
Basapura                          10
1st Block Koramangala             10
Sector 1 HSR Layout               10
                                  ..
Bapuji Layout                      1
1st Stage Radha Krishna Layout     1
BEML Layout 5th stage              1
singapura paradise                 1
Abshot Layout                      1
Name: location, Length: 1053, dtype: int64

In [45]:
data['location']=data['location'].apply(lambda x: 'other' if x in loc_less_10 else x)

In [46]:
data['location'].value_counts()

other                 2885
Whitefield             542
Sarjapur  Road         399
Electronic City        304
Kanakpura Road         273
                      ...
Nehru Nagar             11
Banjara Layout          11
LB Shastri Nagar        11
Pattandur Agrahara      11
Narayanapura            11
Name: location, Length: 242, dtype: int64

In [47]:
data.describe()

         total_sqft          bath         price           BHK  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1569.194241      2.688814    112.565627      2.802778    7.887991e+03
std     1249.984492      1.338754    148.971674      1.294496    1.064301e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.236493e+03
50%     1280.000000      2.000000     72.000000      3.000000    5.416667e+03
75%     1688.090000      3.000000    120.000000      3.000000    7.299270e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [48]:
(data['total_sqft']/data['BHK']).describe()

count    13274.000000
mean       578.548801
std        390.630215
min          0.250000
25%        475.000000
50%        554.000000
75%        627.500000
max      26136.000000
dtype: float64

In [49]:
data=data[((data['total_sqft']/data['BHK'])>=300)]

In [50]:
data.describe()

         total_sqft          bath         price           BHK  price_per_sqft
count  12530.000000  12530.000000  12530.000000  12530.000000    12530.000000
mean    1604.700188      2.559537    111.382401      2.650838     6283.311091
std     1273.034130      1.077938    152.077329      0.976678     4169.230406
min      300.000000      1.000000      8.440000      1.000000      267.829813
25%     1120.000000      2.000000     49.000000      2.000000     4185.707065
50%     1301.000000      2.000000     70.000000      3.000000     5277.186761
75%     1710.000000      3.000000    115.000000      3.000000     6899.358753
max    52272.000000     16.000000   3600.000000     16.000000   176470.588235

In [52]:
data.shape

(12530, 7)

In [53]:
data['price_per_sqft'].describe()

count     12530.000000
mean       6283.311091
std        4169.230406
min         267.829813
25%        4185.707065
50%        5277.186761
75%        6899.358753
max      176470.588235
Name: price_per_sqft, dtype: float64

In [56]:
def remove_outliers_sqft(df):
    df_output=pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m=np.mean(subdf.price_per_sqft)
        
        st=np.std(subdf.price_per_sqft)
        gen_df=subdf[(subdf.price_per_sqft>(m-st))  & (subdf.price_per_sqft<=(m+st))]
        df_output=pd.concat([df_output,gen_df],ignore_index=True)
    
    return df_output

In [57]:
data=remove_outliers_sqft(data)

In [59]:
data.describe()

         total_sqft          bath         price           BHK  price_per_sqft
count  10281.000000  10281.000000  10281.000000  10281.000000    10281.000000
mean    1515.269168      2.471549     91.239490      2.575625     5645.000713
std      895.832200      0.975474     86.312877      0.895267     2269.681851
min      300.000000      1.000000     10.000000      1.000000     1250.000000
25%     1110.000000      2.000000     49.000000      2.000000     4218.930041
50%     1290.000000      2.000000     67.000000      2.000000     5163.333333
75%     1650.000000      3.000000    100.000000      3.000000     6412.698413
max    30400.000000     16.000000   2200.000000     16.000000    24509.803922

In [60]:
data.shape

(10281, 7)

In [63]:
def bhk_outlier_removal(df):
    exclude_indices=np.array([])
    for loc,loc_df in df.groupby('location'):
        bhk_stats={}
        for bhk,bhk_df in loc_df.groupby('BHK'):
            bhk_stats[bhk]={
                'mean':np.mean(bhk_df.price_per_sqft),
                'std':np.std(bhk_df.price_per_sqft),
                'count':bhk_df.shape[0]
            }
        for bhk,bhk_df in loc_df.groupby('BHK'):
            stats=bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices=np.append(exclude_indices,bhk_df[bhk_df.price_per_sqft<(stats['mean'])].index.value)
        return df.drop(exclude_indices,axis='index')

In [64]:
data=bhk_outlier_removal(data)

In [65]:
data.shape

(10281, 7)

In [66]:
data.describe()

         total_sqft          bath         price           BHK  price_per_sqft
count  10281.000000  10281.000000  10281.000000  10281.000000    10281.000000
mean    1515.269168      2.471549     91.239490      2.575625     5645.000713
std      895.832200      0.975474     86.312877      0.895267     2269.681851
min      300.000000      1.000000     10.000000      1.000000     1250.000000
25%     1110.000000      2.000000     49.000000      2.000000     4218.930041
50%     1290.000000      2.000000     67.000000      2.000000     5163.333333
75%     1650.000000      3.000000    100.000000      3.000000     6412.698413
max    30400.000000     16.000000   2200.000000     16.000000    24509.803922

In [67]:
data

,location,size,total_sqft,bath,price,BHK,price_per_sqft
0,1st Block Jayanagar,4 BHK,2850.0,4.0,428.00,4,15017.543860
1,1st Block Jayanagar,3 BHK,1630.0,3.0,194.00,3,11901.840491
2,1st Block Jayanagar,3 BHK,1875.0,2.0,235.00,3,12533.333333
3,1st Block Jayanagar,3 BHK,1200.0,2.0,130.00,3,10833.333333
4,1st Block Jayanagar,2 BHK,1235.0,2.0,148.00,2,11983.805668
...,...,...,...,...,...,...,...
10276,other,2 BHK,1353.0,2.0,110.00,2,8130.081301
10277,other,1 Bedroom,812.0,1.0,26.00,1,3201.970443
10278,other,3 BHK,1440.0,2.0,63.93,3,4439.583333
10279,other,2 BHK,1075.0,2.0,48.00,2,4465.116279
10280,other,4 BHK,3600.0,5.0,400.00,4,11111.111111

In [105]:
data.drop(columns=['size','price_per_sqft'],inplace=True)

In [107]:
data.to_csv("cleaned_data.csv")

In [106]:
data

                  location  total_sqft  bath   price  BHK
0      1st Block Jayanagar      2850.0   4.0  428.00    4
1      1st Block Jayanagar      1630.0   3.0  194.00    3
2      1st Block Jayanagar      1875.0   2.0  235.00    3
3      1st Block Jayanagar      1200.0   2.0  130.00    3
4      1st Block Jayanagar      1235.0   2.0  148.00    2
...                    ...         ...   ...     ...  ...
10276                other      1353.0   2.0  110.00    2
10277                other       812.0   1.0   26.00    1
10278                other      1440.0   2.0   63.93    3
10279                other      1075.0   2.0   48.00    2
10280                other      3600.0   5.0  400.00    4

[10281 rows x 5 columns]

In [108]:
x=data.drop(columns=['price'])
y=data['price']

In [109]:
x

                  location  total_sqft  bath  BHK
0      1st Block Jayanagar      2850.0   4.0    4
1      1st Block Jayanagar      1630.0   3.0    3
2      1st Block Jayanagar      1875.0   2.0    3
3      1st Block Jayanagar      1200.0   2.0    3
4      1st Block Jayanagar      1235.0   2.0    2
...                    ...         ...   ...  ...
10276                other      1353.0   2.0    2
10277                other       812.0   1.0    1
10278                other      1440.0   2.0    3
10279                other      1075.0   2.0    2
10280                other      3600.0   5.0    4

[10281 rows x 4 columns]

In [110]:
y

0        428.00
1        194.00
2        235.00
3        130.00
4        148.00
          ...
10276    110.00
10277     26.00
10278     63.93
10279     48.00
10280    400.00
Name: price, Length: 10281, dtype: float64

In [111]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge
from sklearn.preprocessing import OneHotEncoder,StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [112]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2, random_state=0)

In [113]:
x_train.shape

(8224, 4)

In [114]:
x_test.shape

(2057, 4)

In [88]:
### Applying linear Regression

In [115]:
column_trains=make_column_transformer((OneHotEncoder(sparse=False),['location']),remainder='passthrough')

In [116]:
scaller=StandardScaler()

In [117]:
lr=LinearRegression(normalize=True)

In [118]:
pipe=make_pipeline(column_trains,scaller,lr)

In [119]:
pipe.fit(x_train,y_train)

C:\Users\91776\AppData\Local\Programs\Python\Python310\lib\site-packages\sklearn\linear_model\_base.py:141: FutureWarning: 'normalize' was deprecated in version 1.0 and will be removed in 1.2.
If you wish to scale the data, use Pipeline with a StandardScaler in a preprocessing stage. To reproduce the previous behavior:

from sklearn.pipeline import make_pipeline

model = make_pipeline(StandardScaler(with_mean=False), LinearRegression())

If you wish to pass a sample_weight parameter, you need to pass it as a fit parameter to each step of the pipeline as follows:

kwargs = {s[0] + '__sample_weight': sample_weight for s in model.steps}
model.fit(X, y, **kwargs)


  warnings.warn(

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression(normalize=True))])

In [120]:
y_pred=pipe.predict(x_test)

In [121]:
r2_score(y_test,y_pred)

0.7927060064888197

In [122]:
coef=lr.coef_
intercept=lr.intercept_